[
    {
        "title": "Enabling High Bandwidth Applications over 5G Environments",
        "description": "Millimeter wave technology, commonly known as mmWave, is a vital enabler of the next generation of last-hop communications for mobile devices, with the potential to offer ultra-high-speed wireless communications. These advancements have enabled a range of new applications that employ Virtual Reality (VR) and Augmented Reality (AR) to create numerous promising applications in various fields such as entertainment, education, and healthcare. However, current congestion control protocols are predominantly throughput-oriented and not suitable for handling the strict low-latency and high-throughput requirements imposed by many of the forthcoming new applications. We propose a new delay-based tunable approach to congestion control that relies on looking ahead in time to better control the sending rate while maintaining low latency, making it suitable for AR/VR applications.",
        "img": "/images/projects/zeusthumb.jpg",
        "href": "/project/extendedreality"
    },
    
    {
        "title": "SONIC: Connect the Unconnected via FM Radio & SMS",
        "description": "Over 2.6 billion people remain without access to the Internet in 2025. This disparity is most pronounced in developing regions, with affordability being the primary barrier. Existing solutions like satellite internet (Starlink) and high-altitude networks (Aquila, Loon) are costly and difficult to scale, making them impractical for low-resource areas. We introduce SONIC, a novel connectivity solution that leverages FM radio infrastructure—already covering 70% of the world’s population—to deliver simplified webpages. SONIC exploits the broadcast nature of the radio network, utilizing highly avail- able unused frequencies, to reach long distances. SONIC compresses webpages into images, encodes them to audio signals, and transmits via FM stations. Mobile devices running the SONIC app decode these signals to reconstruct webpages. SONIC also enables Large Language Model (LLM) interactions, transmitting text-based responses",         
        "img": "/images/projects/sonicthumb.gif",
        "href": "/project/sonic"
    },

    
    {
        "title": "Evaluating Congestion Control Protocols in 5G Environments",
        "description": "The rapid evolution of the next generation of mobile networks has paved the path for the development of a wide array of exciting new applications. Instead of gradual and incremental enhancements, each new generation of mobile networks is improving the capabilities of cellular networks tenfold, with 5G typically being 10 times faster than 4G, and 6G anticipated to be an improvement over 5G with an even higher factor. With these rapid exponential improvements, it is important to ensure that all layers of the network stack are able to keep up and support the performance improvements that are available with these new technologies. However, we still lack a clear understanding of the performance characteristics of current state-of-the-art Congestion Control Algorithms (CCA) in 5G environments with high channel fluctuations over short time scales. We conduct an in-depth analysis of 10 CCAs across various 5G environments, including recently proposed and conventional ones, revealing several interesting results.",
        "img": "/images/projects/zeusthumb2.png",
        "href": "/project/zeus"
    },

    {
        "title": "Sustainable AI",
        "description": "Breakthroughs in Artificial Intelligence have fueled a rising demand for a broad spectrum of services harnessing these advanced technologies. These high-demand services rely on data centers, which consume significant amounts of electricity. The resulting carbon emissions from these data centers threaten to exacerbate the climate crisis. Unfortunately, in their current state, it is challenging to rely solely on renewable energy sources such as wind energy and solar energy to support these energy demands in an economically feasible manner. New policies are being implemented to reduce carbon emissions, prompting the need for sustainable design in new systems, such as data centers for AI computation. To satisfy these policy requirements and mitigate carbon emissions, any new system must prioritize sustainability. This project aims to develop a system to assess the economic feasibility of sustainable computing within AI services. The simulator will model interactions between key stakeholders and evaluate the environmental and economic impact of sustainability policies.",
        "img": "/images/projects/sustainability.png",
        "href": "/project/sustainability"
    },

    {
        "title": "Understanding and Mitigating Traffic Jams",
        "description": "Road traffic congestion remains a persistent challenge in urban and suburban areas worldwide, significantly impacting productivity, fuel consumption, and quality of life. While sudden traffic jams can rapidly emerge even without obvious infrastructure bottlenecks, existing traffic control methods often rely on expensive infrastructure upgrades and reactive mechanisms. This project aims to address congestion proactively by combining an in-depth understanding of sudden jam emergence with reinforcement learning-based, infrastructure-free traffic control solutions.",
        "img": "/images/projects/selfregcars.png",
        "href": "https://sites.google.com/view/ankitbhardwaj/Projects/vehicular-traffic-management?authuser=0"
    }
]
